Repository: feelautom/SipLine.Plugin.HelloWorld
Catalog: Resources/Strings.*.resx
Languages: fr

# GuideTitle
source: Developer Guide
fr: Guide Développeur

# GuideSubtitle
source: Welcome to the SipLine ecosystem!
fr: Bienvenue dans l'écosystème SipLine !

# WhatIsPlugin
source: What is a Plugin?
fr: C'est quoi un Plugin ?

# WhatIsPluginDesc
source: SipLine plugins are external modules (DLLs) that extend the softphone's functionality. They allow integrating third-party services, adding business tools, or customizing the user experience.
fr: Les plugins SipLine sont des modules externes (DLL) qui étendent les fonctionnalités du softphone. Ils permettent d'intégrer des services tiers, d'ajouter des outils métier ou de personnaliser l'expérience utilisateur.

# Capabilities
source: What you can do
fr: Ce que vous pouvez faire

# CapCallControl
source: Call Control
fr: Contrôle d'Appels

# CapCallControlDesc
source: Answer, hang up, mute, hold.
fr: Répondre, raccrocher, couper le micro, mettre en attente.

# CapUiExtensionsDesc
source: Add sidebar buttons, tabs, or full pages.
fr: Ajouter des boutons en barre latérale, des onglets ou des pages complètes.

# CapEvents
source: Events
fr: Événements

# CapEventsDesc
source: React to incoming/outgoing calls and SIP state changes.
fr: Réagir aux appels entrants, sortants et changements d'état SIP.

# CapStorage
source: Storage & Config
fr: Stockage & Config

# CapStorageDesc
source: Save secure settings and access call history.
fr: Sauvegarder des paramètres sécurisés et accéder à l'historique.

source: Quick Start
fr: Démarrage Rapide

# QuickStartStep1
source: 1. Create a .NET 9 Class Library project
fr: 1. Créez un projet Class Library .NET 9

# QuickStartStep2
source: 2. Install the SipLine.Plugin.Sdk package
fr: 2. Installez le package SipLine.Plugin.Sdk

# QuickStartStep3
source: 3. Implement the ISipLinePlugin interface
fr: 3. Implémentez l'interface ISipLinePlugin

source: View on GitHub
fr: Voir sur GitHub

# ReadDocs
source: Read the Docs
fr: Lire la Doc

# SidebarTitle
source: SDK Guide
fr: Guide SDK

# SidebarTooltip
source: Developer documentation
fr: Documentation développeur

# PluginName
source: Developer Guide
fr: Guide de Développement

# PluginDescription
source: Discover how to create your own plugins for SipLine.
fr: Découvrez comment créer vos propres plugins pour SipLine.

# SnackbarWorking
source: The HelloWorld plugin is still working!
fr: Le plugin HelloWorld fonctionne toujours !

# SdkCardDesc
source: The official NuGet package to develop your extensions.
fr: Le package NuGet officiel pour développer vos extensions.

# DocsCardDesc
source: Discover the APIs, events and best practices.
fr: Découvrez les API, les événements et les bonnes pratiques.

source: Error opening link.
fr: Erreur lors de l'ouverture du lien.
